---
title: TextNoteOptions
classe: Autodesk.Revit.DB.TextNoteOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# TextNoteOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `HorizontalTextAlignment HorizontalAlignment { get; set; }` | `textNoteOptions.HorizontalAlignment` | HorizontalTextAlignment |
| `Boolean IsValidObject { get; }` | `textNoteOptions.IsValidObject` | Boolean |
| `Boolean KeepRotatedTextReadable { get; set; }` | `textNoteOptions.KeepRotatedTextReadable` | Boolean |
| `Double Rotation { get; set; }` | `textNoteOptions.Rotation` | Double |
| `ElementId TypeId { get; set; }` | `textNoteOptions.TypeId` | ElementId |
| `VerticalTextAlignment VerticalAlignment { get; set; }` | `textNoteOptions.VerticalAlignment` | VerticalTextAlignment |
| `Void Dispose()` | `textNoteOptions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```